In [64]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import sklearn

### Hồi quy tuyến tính

Sử dụng tập dữ liệu giá nhà đất - HousePrice.csv

- Area: Khu vực nhà
- Room: Số phòng trong nhà
- Parking: Có/Không có chỗ đậu xe
- Warehouse: Có/Không có nhà kho
- Elevator: Có/Không có thang máy
- Price: Giá của nhà (USE)

In [65]:
df = pd.read_csv('https://raw.githubusercontent.com/tranlybuu/BaiTap/main/2022/HousePrice.csv')
df = df.drop(['Address','Price'],axis=1)
df.head(5)

  Area  Room  Parking  Warehouse  Elevator  Price(USD)
0   63     1     True       True      True    61666.67
1   60     1     True       True      True    61666.67
2   79     2     True       True      True    18333.33
3   95     2     True       True      True    30083.33
4  123     2     True       True      True   233333.33

In [66]:
from sklearn import preprocessing
# Tách cột giá nhà và chuyển hóa các giá trị True/False thành 1/0
df = df[df.columns[:]].apply(preprocessing.LabelEncoder().fit_transform)
output = df['Price(USD)']
input = df.drop(['Price(USD)'],axis=1)

Mô tả dữ liệu

In [67]:
print("Kích thước của tập dữ liệu:",df.shape)

Kích thước của tập dữ liệu: (3479, 6)

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3479 entries, 0 to 3478
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Area        3479 non-null   int32
 1   Room        3479 non-null   int64
 2   Parking     3479 non-null   int64
 3   Warehouse   3479 non-null   int64
 4   Elevator    3479 non-null   int64
 5   Price(USD)  3479 non-null   int64
dtypes: int32(1), int64(5)
memory usage: 149.6 KB

In [69]:
df.describe()

,Area,Room,Parking,Warehouse,Elevator,Price(USD)
count,3479.000000,3479.000000,3479.000000,3479.000000,3479.000000,3479.000000
mean,141.590974,2.079908,0.847945,0.914631,0.787295,431.971831
std,84.564930,0.758275,0.359126,0.279471,0.409279,232.006456
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,46.000000,2.000000,1.000000,1.000000,1.000000,253.500000
50%,185.000000,2.000000,1.000000,1.000000,1.000000,432.000000
75%,214.000000,2.000000,1.000000,1.000000,1.000000,604.000000
max,242.000000,5.000000,1.000000,1.000000,1.000000,931.000000

Chia tập dữ liệu train và test

In [70]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(input, output, test_size=0.3, random_state=0)

Huấn luyện mô hình với tập dữ liệu train

In [71]:
from sklearn.linear_model import LinearRegression
from sklearn import linear_model
model = linear_model.LinearRegression()
model.fit(X_train, y_train)

LinearRegression()

Kiểm thử mô  hình với tập dữ liệu test

In [72]:
y_pred = model.predict(X_test)
print("accuracy:",model.score(X_test, y_test))
print('mse:',sklearn.metrics.mean_squared_error(y_test, y_pred))

accuracy: 0.46601206447086774
mse: 27576.444051931194

### Hồi quy tuyến tính

In [76]:
df1 = pd.read_csv('https://raw.githubusercontent.com/tranlybuu/BaiTap/main/2022/numberFacebookUser.csv')
df1

    Q3 '08   100
0   Q1 '09   197
1   Q2 '09   242
2   Q3 '09   305
3   Q4 '09   360
4   Q1 '10   431
5   Q2 '10   482
6   Q3 '10   550
7   Q4 '10   608
8   Q1 '11   680
9   Q2 '11   739
10  Q3 '11   800
11  Q4 '11   845
12  Q1 '12   901
13  Q2 '12   955
14  Q3 '12  1007
15  Q4 '12  1056
16  Q1 '13  1110
17  Q2 '13  1155
18  Q3 '13  1189
19  Q4 '13  1228
20  Q1 '14  1276
21  Q2 '14  1317
22  Q3 '14  1350
23  Q4 '14  1393
24  Q1 '15  1441
25  Q2 '15  1490
26  Q3 '15  1545
27  Q4 '15  1591
28  Q1 '16  1654
29  Q2 '16  1712
30  Q3 '16  1788
31  Q4 '16  1860
32  Q1 '17  1936
33  Q2 '17  2006
34  Q3 '17  2072
35  Q4 '17  2129
36  Q1 '18  2196
37  Q2 '18  2234
38  Q3 '18  2271
39  Q4 '18  2320
40  Q1 '19  2375
41  Q2 '19  2414
42  Q3 '19  2449
43  Q4 '19  2498
44  Q1 '20  2603
45  Q2 '20  2701
46  Q3 '20  2740
47  Q4 '20  2797
48  Q1 '21  2853
49  Q2 '21  2895

### Hồi quy logistic